platform/security/rest/security-rest-cxfwrapper/src/test/resources/ecprequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
/**
 * Copyright (c) Codice Foundation
 *
 * This is free software: you can redistribute it and/or modify it under the terms of the GNU Lesser General Public License as published by the Free Software Foundation, either
 * version 3 of the License, or any later version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU Lesser General Public License for more details. A copy of the GNU Lesser General Public License is distributed along with this program and can be found at
 * <http://www.gnu.org/licenses/lgpl.html>.
 *
 **/
-->
<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol"
        xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion">
    <soapenv:Header>
        <ecp:RelayState xmlns:ecp="urn:oasis:names:tc:SAML:2.0:profiles:SSO:ecp"
                        soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next"
                        soapenv:mustUnderstand="1">
            relaystate
        </ecp:RelayState>
        <paos:Request xmlns:paos="urn:liberty:paos:2003-08"
                      service="urn:oasis:names:tc:SAML:2.0:profiles:SSO:ecp"
                      responseConsumerURL="https://sp.example.org/PAOSConsumer"
                      messageID="message1"
                      soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next"
                      soapenv:mustUnderstand="1"/>
        <ecp:Request xmlns:ecp="urn:oasis:names:tc:SAML:2.0:profiles:SSO:ecp"
                     ProviderName="Example Service Provider" IsPassive="0"
                     soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next"
                     soapenv:mustUnderstand="1">
            <saml:Issuer>https://sp.example.org/entity</saml:Issuer>
            <samlp:IDPList>
                <samlp:IDPEntry ProviderID="https://idp.example.org/entity"
                                Name="Example Identity Provider"
                                Loc="https://idp.example.org/saml2/sso"/>
            </samlp:IDPList>
        </ecp:Request>
    </soapenv:Header>
    <soapenv:Body>
        <samlp:AuthnRequest xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" ID="id" Version="2.0" ProviderName="SP test" IssueInstant="2016-07-16T23:52:45Z" Destination="http://idp.example.com/SSOService.php" ProtocolBinding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-POST" AssertionConsumerServiceURL="http://sp.example.com/demo1/index.php?acs">
            <saml:Issuer>http://sp.example.com/demo1/metadata.php</saml:Issuer>
            <samlp:NameIDPolicy Format="urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress" AllowCreate="true"/>
            <samlp:RequestedAuthnContext Comparison="exact">
                <saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport</saml:AuthnContextClassRef>
            </samlp:RequestedAuthnContext>
        </samlp:AuthnRequest>
    </soapenv:Body>
</soapenv:Envelope>